[
  {
    "id": 1,
    "name": "Himitsu Sentai Gorenger",
    "year": "1975",
    "category": "Super Sentai",
    "duration": "20 min",
    "plot": "When world peace is threatened by the emergence of an international secret society of evil called the 'Black Cross Army/Black Crusaders' (黒十字軍 Kuro Jūjigun), the United Nations sets up an international peace organization called 'EAGLE' (EArth Guard LEague) (国際的平和組織イーグル Kokusaiteki Heiwa Soushiki Īguru) to combat the threat. This special army is distributed to various parts of the world (designated as Blocks). One of the largest 'Blocks' is Japan.",
    "opening_video": "https://www.youtube.com/watch?v=gbuEg2v9Arg",
    "imageCard": "https://a.ltrbxd.com/resized/film-poster/3/7/1/8/2/7/371827-himitsu-sentai-gorenger-the-movie-0-230-0-345-crop.jpg?k=449612755c"
  },
  {
    "id": 2,
    "name": "J.A.K.Q. Dengekitai",
    "year": "1977",
    "category": "Super Sentai",
    "duration": "20 min",
    "plot": "Iron Claw is the leader of a global criminal empire known as 'Crime'. Crime has a network of wealthy, influential sympathizers and employs an army of faceless, leather-masked thugs and cyborg assassins. It seeks to become the most powerful mafia organization in the world. To combat the threat of Crime, ISSIS, the International Science Special Investigation Squad, is formed. The focus of the series is ISSIS's battles against Crime in Tokyo and Japan. Tokyo's ISSIS branch commander, Daisuke Kujirai, proposes a radical experiment. Taking the code name 'Joker', he recruits four young test subjects to undergo his cyborg enhancement project: Goro Sakurai, a multi-talented athlete and Olympic Gold medalist; Ryu Higashi, a disgraced boxing champion; Karen Mizuki, a policewoman who has been critically injured; and Bunta Daichi, an oceanographer who is clinically dead and is being cryogenically sustained. All four are surgically altered and given various bionic enhancements as well as energy manipulation powers. They are given the code name J.A.K.Q. Dengekitai, or J.A.K.Q (pronounced 'Jacker'), and the mission to destroy Crime. Later in the series Joker leaves to head ISSIS's advanced engineering branch, and Sokichi Banba, a master of disguise and a cyborg, becomes their new boss, known as Big One.",
    "opening_video": "https://www.youtube.com/watch?v=5a_5MRABxpY",
    "imageCard": "https://krdl.moe/uploads/shows/1530916527.jpg"
  },
  {
    "id": 3,
    "name": "Battle Fever J",
    "year": "1979",
    "category": "Super Sentai",
    "duration": "20 min",
    "plot": "General Kurama assembles four young agents who had been dispatched around the world for training. They are joined by FBI investigator Diane Martin, whose father was murdered by Egos. The five don powered suits to become the Battle Fever team. The Battle Fever team's trump card is the Battle Fever Robo. Egos tries to stop the construction of the Robot, but the monsters they send to perform this task are defeated one by one by the Fever team. Egos then unleashes the 'younger brother' of the Buffalo Monster, a giant robot replica of its 'older brother'. The Robot, fortunately, is finished in time. Aboard it, the Fever team defeats the Buffalo Monster and its successors. The Fever team never stops, even when it lost two of its members (the original Miss America and Battle Cossack). With new members, the team defeats Hedder, now the Hedder Monster, and breaks into Egos' headquarters, where they are fed into the Egos Monster Making Machine so that they may be used as material for a Battle Fever Monster. The team destroys the machine and slays the mysterious deity Satan Egos himself with the Lightning Sword Rocketter sword-throwing move.",
    "opening_video": "https://www.youtube.com/watch?v=W3HHzpeaKao",
    "imageCard": "https://3.bp.blogspot.com/-xNeuaA93J7U/XjyE8wpthqI/AAAAAAAAAHE/4cD5qDchJtgHz15UJ-BeZxhALpVn2LreQCLcBGAsYHQ/s1600/1979%2B-%2BBattle%2BFever%2BJ.jpg"
  },
  {
    "id": 4,
    "name": "Denshi Sentai Denjiman",
    "year": "1980",
    "category": "Super Sentai",
    "duration": "20 min",
    "plot": "3,000 years ago, the Vader Clan, led by Queen Hedrian, devastated the planet Denji. Denji Land, an island from Denji, landed on Earth. In modern times, the computer of Denji Land awoke the Denji Dog IC when it detected the Vader Clan approaching Earth. IC found five young people (who may or may not be descendants of the Denji people) to become the Denjimen in order to defend Earth, the Vader Clan's next target.",
    "opening_video": "https://www.youtube.com/watch?v=TqR1UTxHgYk",
    "imageCard": "https://3.bp.blogspot.com/-8jcXwB1WuKw/XkG3ObVjJwI/AAAAAAAAAJ8/6lIQ5Uj4sfQa-L4nzhmO-ppL_Eh5PCMTgCLcBGAsYHQ/w230-h290-c/DENZIMAN.jpg"
  },
  {
    "id": 5,
    "name": "Taiyo Sentai Sun Vulcan",
    "year": "1981",
    "category": "Super Sentai",
    "duration": "20 min",
    "plot": "The threat of the Machine Empire Black Magma causes the United Nations to establish the Solar Sentai at a summit. From the UN's Guardians of World Peace's (GWP) air force, navy, and rangers, Commander Arashiyama assembles three specialists to become Sun Vulcan. When Black Magma learns of this, he attacks the GWP's base, but Sun Vulcan debuts in time to save it. Hell Saturn prays to the Black Solar God and is rewarded with a revived Queen Hedrian, now a cyborg with a mechanical heart and a metallic afro. Black Magma multiple plots, even with Hedrian's aid, fails. Following the death of 01, Amazon Killer, (a Vader) arrives from space, destroying the Sun Vulcan Base. A new Vulcan Base is then built. The original Vul Eagle, Ryusuke Ohwashi, is replaced by a friend and master of the sword, Takayuki Hiba.",
    "opening_video": "https://www.youtube.com/watch?v=7BPFUWRswBw",
    "imageCard": "https://1.bp.blogspot.com/-MqOL__qBWAg/XkDKGLBwZ4I/AAAAAAAAAJQ/_7TxBV8er84gp_Q5kdBkjJNOjXrxClTUgCLcBGAsYHQ/s320/1981%2B-%2BSun%2BVulcan.jpg"
  },
  {
    "id": 6,
    "name": "Dai Sentai Goggle-V",
    "year": "1982",
    "category": "Super Sentai",
    "duration": "20 min",
    "plot": "The Dark Science Empire Desdark launches its scheme for world conquest from their Destopia Castle in Germany. Dr. Hideki Hongo, founder of the Future Science Laboratory, is saved from one of their attacks by world class explorer Kenichi Akama. Using his Computer Boys & Girls, Hongo recruits five people, including Kenichi, to form the Dai Sentai Goggle-V (Goggle 5), the only force capable of stopping Desdark.",
    "opening_video": "https://www.youtube.com/watch?v=US8Yty-Nuxk",
    "imageCard": "https://m.media-amazon.com/images/M/MV5BYWM0YTNhZGItOTg0ZC00Mjc4LTk4N2YtNzQwMjQ5MjRhZmQ2XkEyXkFqcGdeQXVyNzkyMDA5MTc@._V1_UY268_CR4,0,182,268_AL_.jpg"
  },
  {
    "id": 7,
    "name": "Kagaku Sentai Dynaman",
    "year": "1983",
    "category": "Super Sentai",
    "duration": "20 min",
    "plot": "The Jashinka Empire rises from the depths of the Earth to conquer the world. To stop them, Dr. Kyutaro Yumeno assembles five inventors to his laboratory, Yumeno Invention Laboratory and gives them the power to become Dynamen. Each member has their own goal, but as the Kagaku Sentai Dynaman, they are united to stop the Jashinka Empire in their tracks.",
    "opening_video": "https://www.youtube.com/watch?v=fKcEvrOWhBc",
    "imageCard": "https://4.bp.blogspot.com/-p-751Ot7cCQ/Xk7LQKiUtDI/AAAAAAAAAMc/dm1aJjhPYvw11scZY5Tfd_iP3zoZcvWOgCLcBGAsYHQ/w230-h290-c/DYNAMAN.jpg"
  },
  {
    "id": 8,
    "name": "Choudenshi Bioman",
    "year": "1984",
    "category": "Super Sentai",
    "duration": "20 min",
    "plot": "The once prosperous Planet Bio (バイオ星, Baio-sei) is destroyed after a world war erupted over the use of a scientific discovery called 'Bio Particles'. The Planet Bio Peacekeeping Alliance (バイオ星平和連合, Baio-sei Heiwa Rengō), which sought to use Bio Particles for peaceful purposes, sends the giant robot Bio Robo and an assistant robot named Peebo to prevent the same tragedy from happening on Earth. Bio Robo arrives in 15th century Japan, where it showers Bio Particles on five young individuals. Five centuries later, the descendants of these individuals, infused with Bio Particles, are chosen by Peebo and Bio Robo to become the Bioman team to protect the Earth from the Neo-Empire Gear, an organization led by mad scientist Doctor Man.",
    "opening_video": "https://www.youtube.com/watch?v=pjSgvo787Yo",
    "imageCard": "https://4.bp.blogspot.com/-27e7ZKy4SgY/Xk2QuUUv2sI/AAAAAAAAAMQ/goM2x3_26WohO11SbMRAQQ7XXGJt9WkvACLcBGAsYHQ/w230-h290-c/1984%2B-%2BBioman.jpg"
  },
  {
    "id": 9,
    "name": "Dengeki Sentai Changeman",
    "year": "1985",
    "category": "Super Sentai",
    "duration": "20 min",
    "plot": "After conquering hundreds of planets, the Star Clustere Gozma sets its sights on Earth. To defend it, the Japanese military forms an elite Earth Defense Force. Under Commander Ibuki, the force begins rigorous training. Meanwhile, as their first act, the Gozma decide to eliminate those who pose the greatest risk of interfering with their invasion: the military. After a brutal day of training, the Earth Defense Force recruits are fed up with Ibuki's cruel ways and leave the training session. Soon afterwards, they are attacked by Gozma troops. Five surviving officers gather together, beaten and exhausted but refusing to retreat from the threat. The Earth trembles, empowering them with the Earth Force, giving them the power of mythological beasts and becoming the Changeman. With the mystical power of the Earth Force and military technology, the Changeman begin their war against Gozma.",
    "opening_video": "https://www.youtube.com/watch?v=d-7MzNRs4CY",
    "imageCard": "https://krdl.moe/uploads/shows/1516560813.jpg"
  },
  {
    "id": 10,
    "name": "Choushinsei Flashman",
    "year": "1986",
    "category": "Super Sentai",
    "duration": "20 min",
    "plot": "In 1966, five children were kidnapped by an alien group known as the Alien Hunters for the Reconstructive Experiment Empire Mess, who wanted samples of humans from Earth to experiment on. The children were rescued by Mess' arch enemy, the Flash alien race, which took each one to a different planet of the Flash solar system for training. Each of them was trained separately in a range of superpowers that will allow them to fight Mess, their bodies also adapted to the atmosphere of the Flash Solar System making them gain special abilities. When they finally return to Earth in 1986 to combat Mess, who is now trying to invade it, they use the opportunity to search for their birth parents.",
    "opening_video": "https://www.youtube.com/watch?v=vzKTRJsoyvo",
    "imageCard": "https://media.fstatic.com/FTLJ8CMnTuCRGg4Np6oS4GKX-Jg=/210x312/smart/media/movies/covers/2017/07/Flashman_DVD_Vol_1.jpg"
  }
]
